# Food Delivery Data Integration & Analysis

Objective:
Merge orders, users, and restaurant data into a single source of truth
and perform exploratory data analysis to derive business insights.

In [1]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt

In [2]:
orders = pd.read_csv("orders.csv")
users = pd.read_json("users.json")

conn = sqlite3.connect(":memory:")
conn.executescript(open("restaurants.sql").read())
restaurants = pd.read_sql("SELECT * FROM restaurants", conn)

In [3]:
df = orders.merge(users, on="user_id", how="left")
df = df.merge(restaurants, on="restaurant_id", how="left")

df.drop(columns=['restaurant_name_x'], inplace=True)
df.rename(columns={'restaurant_name_y': 'restaurant_name'}, inplace=True)

df['order_date'] = pd.to_datetime(df['order_date'], format='%d-%m-%Y')

In [4]:
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         10000 non-null  int64
 1   user_id          10000 non-null  int64
 2   restaurant_id    10000 non-null  int64
 3   order_date       10000 non-null  datetime64[ns]
 4   total_amount     10000 non-null  float64
 5   name             10000 non-null  object
 6   city             10000 non-null  object
 7   membership       10000 non-null  object
 8   restaurant_name  10000 non-null  object
 9   cuisine          10000 non-null  object
 10  rating           10000 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(5)
memory usage: 937.5+ KB

In [5]:
df.to_csv("final_food_delivery_dataset.csv", index=False)

In [6]:
df.groupby('membership')['total_amount'].mean()

membership
Gold       797.145556
Regular    805.158434
Name: total_amount, dtype: float64

In [7]:
df.groupby(df['order_date'].dt.month)['order_id'].count()

order_date
1     831
2     785
3     903
4     812
5     844
6     784
7     859
8     851
9     812
10    863
11    807
12    849
Name: order_id, dtype: int64

In [8]:
df.groupby(df['order_date'].dt.month)['total_amount'].sum()

order_date
1     663020.26
2     630867.40
3     716738.98
4     666097.18
5     668428.61
6     610822.93
7     688559.45
8     694987.58
9     653838.07
10    699187.73
11    637772.43
12    681303.50
Name: total_amount, dtype: float64

In [9]:
df.groupby('city')['total_amount'].sum().sort_values(ascending=False)

city
Bangalore    2206946.58
Chennai      1990513.03
Pune         1924797.93
Hyderabad    1889366.58
Name: total_amount, dtype: float64

In [10]:
df.groupby('cuisine')['order_id'].count().sort_values(ascending=False)

cuisine
Mexican    2581
Italian    2532
Indian     2469
Chinese    2418
Name: order_id, dtype: int64

In [12]:
df[df['membership'] == 'Gold'].groupby('city')['total_amount'].sum().sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [13]:
df.groupby('cuisine')['total_amount'].mean().sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [14]:
high_value_users = (
    df.groupby('user_id')['total_amount']
      .sum()
      .reset_index()
)

high_value_users[high_value_users['total_amount'] > 1000]['user_id'].nunique()

2544

In [15]:
df['rating_range'] = pd.cut(
    df['rating'],
    bins=[3.0, 3.5, 4.0, 4.5, 5.0],
    labels=['3.0 – 3.5', '3.6 – 4.0', '4.1 – 4.5', '4.6 – 5.0'],
    include_lowest=True
)

df.groupby('rating_range')['total_amount'].sum().sort_values(ascending=False)

rating_range
4.6 – 5.0    2197030.75
3.0 – 3.5    2136772.70
4.1 – 4.5    1960326.26
3.6 – 4.0    1717494.41
Name: total_amount, dtype: float64

In [16]:
gold_df = df[df['membership'] == 'Gold']
gold_df.groupby('city')['total_amount'].mean().sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [17]:
restaurant_counts = df.groupby('cuisine')['restaurant_name'].nunique()
revenue_per_cuisine = df.groupby('cuisine')['total_amount'].sum()

cuisine_summary = pd.DataFrame({
    'num_restaurants': restaurant_counts,
    'total_revenue': revenue_per_cuisine
}).sort_values(by='num_restaurants')

cuisine_summary

         num_restaurants  total_revenue
cuisine
Chinese              120     1930504.65
Indian               126     1971412.58
Italian              126     2024203.80
Mexican              128     2085503.09

In [18]:
total_orders = df.shape[0]
gold_orders = df[df['membership'] == 'Gold'].shape[0]

percentage_gold = round((gold_orders / total_orders) * 100)
percentage_gold

50

In [19]:
restaurant_stats = df.groupby('restaurant_name').agg(
    total_orders=('order_id', 'count'),
    avg_order_value=('total_amount', 'mean')
).reset_index()

small_restaurants = restaurant_stats[restaurant_stats['total_orders'] < 20]
small_restaurants.sort_values(by='avg_order_value', ascending=False)

    restaurant_name  total_orders  avg_order_value
216  Restaurant_294            13      1040.222308
181  Restaurant_262            18      1029.473333
475   Restaurant_77            12      1029.180833
104  Restaurant_193            15      1026.306667
467    Restaurant_7            16      1002.140625
..              ...           ...              ...
94   Restaurant_184            19       621.828947
442  Restaurant_498            18       596.815556
103  Restaurant_192            14       589.972857
255  Restaurant_329            15       578.578667
224  Restaurant_300            17       572.686471

[241 rows x 3 columns]

In [20]:
restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [21]:
restaurant_stats = df.groupby('restaurant_id').agg(
    total_orders=('order_id', 'count'),
    avg_order_value=('total_amount', 'mean')
).reset_index()

restaurant_stats = restaurant_stats.merge(restaurants[['restaurant_id','restaurant_name']], on='restaurant_id', how='left')
small_restaurants = restaurant_stats[restaurant_stats['total_orders'] < 20]

small_restaurants.sort_values(by='avg_order_value', ascending=False)

     restaurant_id  total_orders  avg_order_value restaurant_name
293            294            13      1040.222308  Restaurant_294
261            262            18      1029.473333  Restaurant_262
76              77            12      1029.180833   Restaurant_77
192            193            15      1026.306667  Restaurant_193
6                7            16      1002.140625    Restaurant_7
..             ...           ...              ...             ...
183            184            19       621.828947  Restaurant_184
497            498            18       596.815556  Restaurant_498
191            192            14       589.972857  Restaurant_192
328            329            15       578.578667  Restaurant_329
299            300            17       572.686471  Restaurant_300

[241 rows x 4 columns]

In [23]:
restaurants.columns

Index(['restaurant_id', 'restaurant_name', 'cuisine', 'rating'], dtype='object')

In [24]:
restaurant_stats = df.groupby('restaurant_id').agg(
    total_orders=('order_id', 'count'),
    avg_order_value=('total_amount', 'mean')
).reset_index()

small_restaurants = restaurant_stats[restaurant_stats['total_orders'] < 20]

small_restaurants_real = small_restaurants.merge(
    restaurants[['restaurant_id','restaurant_name']],
    on='restaurant_id',
    how='left'
)

small_restaurants_real.sort_values(by='avg_order_value', ascending=False).head(10)

     restaurant_id  total_orders  avg_order_value restaurant_name
143            294            13      1040.222308  Restaurant_294
126            262            18      1029.473333  Restaurant_262
30              77            12      1029.180833   Restaurant_77
92             193            15      1026.306667  Restaurant_193
4                7            16      1002.140625    Restaurant_7
144            298            15       989.822000  Restaurant_298
23              56            18       989.467222   Restaurant_56
61             135            18       988.702222  Restaurant_135
167            343            17       986.026471  Restaurant_343
153            312            14       982.730000  Restaurant_312

In [25]:
import sqlite3
conn = sqlite3.connect(":memory:")
with open("restaurants.sql", "r") as f:
    sql_script = f.read()
conn.executescript(sql_script)
restaurants = pd.read_sql("SELECT * FROM restaurants", conn)

restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [29]:
restaurant_stats = df.groupby('restaurant_name').agg(
    total_orders=('order_id', 'count'),
    avg_order_value=('total_amount','mean')
).reset_index()

small_restaurants = restaurant_stats[restaurant_stats['total_orders'] < 20]

top_restaurant = small_restaurants.sort_values(by='avg_order_value', ascending=False).head(1)

top_restaurant

    restaurant_name  total_orders  avg_order_value
216  Restaurant_294            13      1040.222308

In [28]:
orders_original = pd.read_csv("orders.csv")

orders_real_names = orders_original[['order_id', 'restaurant_name']]

final_with_real_names = df.merge(
    orders_real_names,
    on='order_id',
    how='left',
    suffixes=('_generic','_real')
)

restaurant_stats = final_with_real_names.groupby('restaurant_name_real').agg(
    total_orders=('order_id','count'),
    avg_order_value=('total_amount','mean')
).reset_index()

small_restaurants = restaurant_stats[restaurant_stats['total_orders'] < 20]
small_restaurants.sort_values(by='avg_order_value', ascending=False).head(10)

                      restaurant_name_real  total_orders  avg_order_value
173               Hotel Dhaba Multicuisine            13      1040.222308
354                       Sri Mess Punjabi            12      1029.180833
236                  Ruchi Biryani Punjabi            16      1002.140625
343                  Sri Delights Pure Veg            18       989.467222
88       Classic Kitchen Family Restaurant            19       973.167895
172                    Hotel Dhaba Chinese            18       973.125556
28                      Amma Mess Pure Veg            18       965.299444
161                 Hotel Biryani Pure Veg            13       964.577692
41      Annapurna Curry House Multicuisine            17       954.512353
405  Taste of Restaurant Family Restaurant            10       948.220000

In [32]:
final_df = pd.read_csv("final_food_delivery_dataset.csv")
orders_original = pd.read_csv("orders.csv")  # has the real names

merged_df = final_df.merge(
    orders_original[['order_id','restaurant_name']],
    on='order_id',
    how='left',
    suffixes=('_generic','_real')
)

restaurant_294 = merged_df[merged_df['restaurant_name_generic'] == 'Restaurant_294'][['restaurant_name_generic','restaurant_name_real']].drop_duplicates()
restaurant_294

     restaurant_name_generic      restaurant_name_real
1407          Restaurant_294  Hotel Dhaba Multicuisine

In [33]:
mcq_options = [
    "Grand Cafe Punjabi",
    "Grand Restaurant South Indian",
    "Ruchi Mess Multicuisine",
    "Ruchi Foods Chinese"
]

existing_options = merged_df['restaurant_name_real'].isin(mcq_options)

mcq_in_dataset = [name for name in mcq_options if name in merged_df['restaurant_name_real'].values]
mcq_not_in_dataset = [name for name in mcq_options if name not in merged_df['restaurant_name_real'].values]

print("MCQ options present in dataset:", mcq_in_dataset)
print("MCQ options NOT present in dataset:", mcq_not_in_dataset)

MCQ options present in dataset: ['Grand Cafe Punjabi', 'Grand Restaurant South Indian', 'Ruchi Mess Multicuisine', 'Ruchi Foods Chinese']
MCQ options NOT present in dataset: []

In [34]:
mcq_df = merged_df[merged_df['restaurant_name_real'].isin(mcq_options)]

restaurant_stats = mcq_df.groupby('restaurant_name_real').agg(
    total_orders=('order_id', 'count'),
    avg_order_value=('total_amount','mean')
).reset_index()

small_restaurants = restaurant_stats[restaurant_stats['total_orders'] < 20]

small_restaurants.sort_values(by='avg_order_value', ascending=False)

  restaurant_name_real  total_orders  avg_order_value
2  Ruchi Foods Chinese            19       686.603158

In [35]:
combo_revenue = df.groupby(['membership','cuisine']).agg(
    total_revenue=('total_amount','sum')
).reset_index()

combo_revenue.sort_values(by='total_revenue', ascending=False)

  membership  cuisine  total_revenue
7    Regular  Mexican     1072943.30
6    Regular  Italian     1018424.75
3       Gold  Mexican     1012559.79
2       Gold  Italian     1005779.05
5    Regular   Indian      992100.27
1       Gold   Indian      979312.31
0       Gold  Chinese      977713.74
4    Regular  Chinese      952790.91

In [36]:
df['order_date'] = pd.to_datetime(df['order_date'], dayfirst=True)

In [37]:
df['quarter'] = df['order_date'].dt.quarter
quarter_revenue = df.groupby('quarter').agg(
    total_revenue=('total_amount','sum')
).sort_values(by='total_revenue', ascending=False)
quarter_revenue

         total_revenue
quarter
3           2037385.10
4           2018263.66
1           2010626.64
2           1945348.72

In [38]:
gold_orders = df[df['membership'] == 'Gold']

total_gold_orders = gold_orders['order_id'].count()
total_gold_orders

4987

In [39]:
hyderabad_revenue = df[df['city'] == 'Hyderabad']['total_amount'].sum()
hyderabad_revenue_rounded = round(hyderabad_revenue)
hyderabad_revenue_rounded

1889367

In [40]:
distinct_users = df['user_id'].nunique()
distinct_users

2883

In [41]:
gold_orders = df[df['membership'] == 'Gold']

avg_order_value_gold = gold_orders['total_amount'].mean()
avg_order_value_gold_rounded = round(avg_order_value_gold, 2)
avg_order_value_gold_rounded

797.15

In [42]:
high_rating_orders = df[df['rating'] >= 4.5]

total_high_rating_orders = high_rating_orders['order_id'].count()
total_high_rating_orders

3374

In [43]:
gold_orders = df[df['membership'] == 'Gold']

gold_city_revenue = gold_orders.groupby('city')['total_amount'].sum()

top_gold_city = gold_city_revenue.idxmax()
top_gold_city

'Chennai'

In [44]:
total_orders_top_gold_city = gold_orders[gold_orders['city'] == top_gold_city]['order_id'].count()
total_orders_top_gold_city

1337

In [45]:
total_rows = df.shape[0]
print("Total number of rows:", total_rows)

Total number of rows: 10000